In [15]:
import pandas as pd 
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
from sklearn.linear_model import LinearRegression
model = LinearRegression()
import word2number 
from word2number import w2n

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/ML/2_linear_reg_multivariate/Exercise/hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [34]:
df.to_csv("C:\\Users\\rajan\\OneDrive\\Desktop\\file_run\\ML\\ML_data\\salary_expect.csv")

In [4]:
import math
test_score_median = df['test_score(out of 10)'].mean()
test_score_median

7.857142857142857

# Replacing NaN value with proper expected values

In [7]:
df.experience = df['experience'].fillna(0)
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(test_score_median)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0               8.000000                           9      50000
1          0               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

# creating new column to numeric value

In [23]:
df['ExperienceNum'] = [w2n.word_to_num(str(x)) for x in df.experience]
df

,experience,test_score(out of 10),interview_score(out of 10),salary($),ExperienceNum
0,0,8.000000,9,50000,0
1,0,8.000000,6,45000,0
2,five,6.000000,7,60000,5
3,two,10.000000,10,65000,2
4,seven,9.000000,6,70000,7
5,three,7.000000,10,62000,3
6,ten,7.857143,7,72000,10
7,eleven,7.000000,8,80000,11

In [30]:
df = df.drop(['experience'] , axis = 'columns')
df

   test_score(out of 10)  interview_score(out of 10)  salary($)  ExperienceNum
0               8.000000                           9      50000              0
1               8.000000                           6      45000              0
2               6.000000                           7      60000              5
3              10.000000                          10      65000              2
4               9.000000                           6      70000              7
5               7.000000                          10      62000              3
6               7.857143                           7      72000             10
7               7.000000                           8      80000             11

# Model training

In [31]:
model = LinearRegression()
model.fit(df[['ExperienceNum','test_score(out of 10)','interview_score(out of 10)']] , df['salary($)'])

LinearRegression()

# Prediction

In [33]:
model.predict([[2,6, 9]])  # experince = 2yrs , test_score = 6 , interveiw_score = 9

C:\Users\rajan\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([54143.00441016])